package Webinar004;

public class Main {
    public static void main(String[] args) {
        /*
        LinkedList - это тот же ArrayList, только хранится в памяти не по индексам, а по ссылкам. Каждый эллемент
        LinkedList имеет ссылку на предыдущий обьект и на следующий. Из-за этого в него удобно вставлять или удалять
        элементы. Например, если в многомиллионный линкедлист вставить эллемент посередине, то надо всего-навсего поменять
        ссылки у двух элементов посередине, а в случае с ArrayList будут сдвигаться все эллементы начиная с серидины.
        Очередь Queue.
        Stack.
         */
    }
}
